type_input = input("Выберите тип измерения время/расстояние/скорость: ")
units = {
    'время':'с/мин/ч/сутки',
    'расстояние': 'см/дм/м/км/миля',
    'скорость': 'м/с / км/ч / миль/ч'
}
start_unit_choice = input(f"Введите исходную единицу {units[type_input]}: ")
final_unit_choice = input(f"Введите конечную единицу {units[type_input]}: ")
value_input = float(input('Введите значению для перевода: '))


unit_convert = {
    'с': 1,
    'мин' : 60,
    'ч' : 3600 ,
    'сутки': 86400,
    'см': 0.01,
    'дм': 0.1,
    'м': 1,
    'км': 1000,
    'м/с': 1 ,
    'км/ч': 3.6,
    'миль/ч': 2.237
}